MESSAGE__HI = """
Если хочешь узнать о моих возможностях -
/about

Узнай список команд для взаимодействия со мной -
/help
"""

MESSAGE__HELP_1 = """
Краткая инструкция, как пользоваться ботом.

<b>Для старта записи вашего дня, введите:</b>
/start_task_recording

<b>В состоянии записи и ожидания ввода вы можете в выйти из данного режима:</b>
/exit

После запуска режима записи у вас появится окно со стартовым списком дел:
"""

MESSAGE__HELP_2 = """
<b>Редактируйте список дел, добавив свои записи:</b>
- Введите:
/set_new_employment

- <b>Если добавили не то или вам уже не нужно определенная активность, удалите ее</b>:
/delete_employment
"""

MESSAGE__HELP_3 = """
После надписи "<b>Ожидания ввода...</b>", вы уже можете вводить, чем вы в данный момент занимаетесь.
Для этого удобно использовать всплывающую клавиатуру со списком дел, как было показано на фотографии выше.
Однако вам никто не запрещает просто ввести занятие с обычной клавиатуры.

❗ При нажатии <b>Изменить</b>, время старта не изменится, оно останится таким же, как в момент,
когда вы отправили свое занятие. Вы можете изменить лишь название рода деятельности ❗

После того, как вы нажали <b>Закончить</b>, зафиксируется окончательное время занятия.
И после этого вы можете ввести уже другое занятие.

❗ Если вы хотите продолжить занятие, но случайно нажали <b>Закончить</b>, то вам уже ничего не поможет. ❗
"""

MESSAGE__HELP_4 = """
Шучу конечно 😝 Для продолжения случайно законченного занятия, за ним введите сразу такое же. Общее время
Всех занятий в конечном итоге суммируется.

<b>Как посмотреть информацию о днях</b>?
- Введите:
/info
Или, в зависимости от дня, статистику которого вы хотите посмотреть:
/info_1 /info_2 ... /info_7 
"""

MESSAGE__ABOUT = """
Никогда не задумывались, сколько времени вы тратите на различные задачи в процессе дня? 

Теперь вы можете узнать об этом с помощью моего телеграмм бота!
Он засекает время, которое вы тратите на различные задачи,
и выводит подробную статистику, чтобы вы могли эффективно планировать свой день.

Предлагаю провести интересный эксперимент, который не требует много усилий.
Попробуйте использовать моего телеграмм бота
на протяжении недели и посмотрите, как изменится ваша продуктивность и эффективность!
Вы сможете узнать, сколько времени вы тратите на различные
задачи, и обдумать, как распределить свое время более равномерно.

Для того, чтобы узнать, как пользоваться ботом, используйте:
/help
"""

MESSAGE__MAIN_MENU = """
<b>==========Main_menu==========</b>

<b>Описание бота:</b>
/about

<b>Промежуточные результаты:</b>
/info

<b>Настройки:</b>
/options

<b>Запуск бота:</b>
/start_task_recording
"""

MESSAGE__START_TIME_RECORDING = """
Пожалуйста, выберите занятие, чем 
вы в данный момент будете заниматься.

Для добавления нового рода занятия используйте комманду:
/set_new_employment

Удалите лишнее дело из вашего списка:
/delete_employment

Если что-то непонятно, используйте:
/help
"""

MESSAGE__SET_NEW_EMPLOYMENT = """
/Добавьте следующее дело в ваш список:
/set_new_employment

Для удаления из списка дел, воспользуйтесь коммандой:
/delete_employment
"""

MESSAGE__OPTIONS = """
<b>================_OPTIONS_================</b>

<b>Показывать/скрыть стандартный список дел:</b>
/default_employment_list
"""